================================================================================
Bold decoration
================================================================================
[* bold text]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_decoration_markers)
        (bracket_text)
        (bracket_ws)
        (bracket_text)))))

================================================================================
Italic decoration
================================================================================
[/ italic text]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_decoration_markers)
        (bracket_text)
        (bracket_ws)
        (bracket_text)))))

================================================================================
Underline decoration
================================================================================
[_ underline text]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_decoration_markers)
        (bracket_text)
        (bracket_ws)
        (bracket_text)))))

================================================================================
Deleted decoration
================================================================================
[- deleted text]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_decoration_markers)
        (bracket_text)
        (bracket_ws)
        (bracket_text)))))

================================================================================
Multiple decorations on one line
================================================================================
[* bold] and [/ italic]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_decoration_markers)
        (bracket_text)))
    (text
      (text_segment))
    (bracket_expr
      (bracket_content
        (bracket_decoration_markers)
        (bracket_text)))))

================================================================================
Inline code
================================================================================
[` some code `]
--------------------------------------------------------------------------------

(document
  (line
    (code_inline
      (code_inline_content))))

================================================================================
Inline code with special chars
================================================================================
[` x = [1, 2, 3] `]
--------------------------------------------------------------------------------

(document
  (line
    (code_inline
      (code_inline_content))))

================================================================================
Inline math
================================================================================
[$ E = mc^2 $]
--------------------------------------------------------------------------------

(document
  (line
    (math_inline
      (math_inline_content))))

================================================================================
Inline math complex
================================================================================
[$ \sum_{i=0}^{n} x_i $]
--------------------------------------------------------------------------------

(document
  (line
    (math_inline
      (math_inline_content))))

================================================================================
Mixed inline elements
================================================================================
Text [* bold] and [` code `] here
--------------------------------------------------------------------------------

(document
  (line
    (text
      (text_segment))
    (bracket_expr
      (bracket_content
        (bracket_decoration_markers)
        (bracket_text)))
    (text
      (text_segment))
    (code_inline
      (code_inline_content))
    (text
      (text_segment))))
