================================================================================
Simple wiki link
================================================================================
[page name]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_text)
        (bracket_ws)
        (bracket_text)))))

================================================================================
Wiki link with anchor
================================================================================
[page name#section]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_text)
        (bracket_ws)
        (bracket_text)
        (bracket_hash)))))

================================================================================
Anchor-only link
================================================================================
[#section]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_hash)))))

================================================================================
URL link
================================================================================
[https://example.com]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_url)))))

================================================================================
URL link with title
================================================================================
[https://example.com Example Site]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_url)
        (bracket_ws)
        (bracket_text)
        (bracket_ws)
        (bracket_text)))))

================================================================================
URL link with title first
================================================================================
[Example Site https://example.com]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_text)
        (bracket_ws)
        (bracket_text)
        (bracket_ws)
        (bracket_url)))))

================================================================================
Mail link
================================================================================
[mailto:user@example.com]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_mail)))))

================================================================================
Local file link
================================================================================
[path/to/file.txt]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_local_file)))))

================================================================================
Text with wiki link in middle
================================================================================
See [page name] for details
--------------------------------------------------------------------------------

(document
  (line
    (text
      (text_segment))
    (bracket_expr
      (bracket_content
        (bracket_text)
        (bracket_ws)
        (bracket_text)))
    (text
      (text_segment))
    (text
      (text_segment))))

================================================================================
Multiple links on one line
================================================================================
[page1] and [page2]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_text)))
    (text
      (text_segment))
    (bracket_expr
      (bracket_content
        (bracket_text)))))

================================================================================
URL with complex path
================================================================================
[https://example.com/path/to/page?query=value&other=1#fragment]
--------------------------------------------------------------------------------

(document
  (line
    (bracket_expr
      (bracket_content
        (bracket_url)))))
