================================================================================
Simple property
================================================================================
{@task}
--------------------------------------------------------------------------------

(document
  (line
    (property
      (property_name))))

================================================================================
Property with key-value pairs
================================================================================
{@task status=todo due=2024-12-31}
--------------------------------------------------------------------------------

(document
  (line
    (property
      (property_name)
      (property_kv
        (property_word)
        (property_word))
      (property_kv
        (property_word)
        (property_word)))))

================================================================================
Property with positional arg
================================================================================
{@tag important}
--------------------------------------------------------------------------------

(document
  (line
    (property
      (property_name)
      (property_word))))

================================================================================
Property after text
================================================================================
Some task description {@task status=todo}
--------------------------------------------------------------------------------

(document
  (line
    (text
      (text_segment))
    (text
      (text_segment))
    (text
      (text_segment))
    (property
      (property_name)
      (property_kv
        (property_word)
        (property_word)))))

================================================================================
Anchor
================================================================================
#my-anchor
--------------------------------------------------------------------------------

(document
  (line
    (anchor)))

================================================================================
Task todo marker
================================================================================
!2024-12-31
--------------------------------------------------------------------------------

(document
  (line
    (task)))

================================================================================
Task doing marker
================================================================================
*2024-10-10
--------------------------------------------------------------------------------

(document
  (line
    (task)))

================================================================================
Task done marker
================================================================================
-2024-01-01
--------------------------------------------------------------------------------

(document
  (line
    (task)))

================================================================================
Task with time
================================================================================
!2024-12-31T14:30
--------------------------------------------------------------------------------

(document
  (line
    (task)))

================================================================================
Text with trailing task
================================================================================
Buy groceries !2024-12-31
--------------------------------------------------------------------------------

(document
  (line
    (text
      (text_segment))
    (text
      (text_segment))
    (task)))

================================================================================
Multiple properties and tasks
================================================================================
Project meeting !2024-03-15 {@task status=todo}
--------------------------------------------------------------------------------

(document
  (line
    (text
      (text_segment))
    (text
      (text_segment))
    (task)
    (property
      (property_name)
      (property_kv
        (property_word)
        (property_word)))))
